Revit 2027 API
EnergyDataSettings Properties
The EnergyDataSettings type exposes the following members.
Properties
Name | Description
AnalysisType |  The type of analysis mode.
AnalyticalGridCellSize |  The cell size for the uniform cubical grid used when computing the building envelope. This property is ingnored unless AnalysisType is RoomsOrSpaces and BuildingEnvelopeDeterminationMethod is IdentifyExteriorElements.
AnalyticalSpaceResolution |  Analytical Space Resolution defines the minimum gap between Revit elements that will be ignored in the identification of energy analytical model spaces. This setting is ignored if AnalysisType is RoomsOrSpaces.
AnalyticalSurfaceResolution |  Analytical Surface Resolution defines the smallest dimension of any surface to be included in the energy analytical model. This setting is ignored if AnalysisType is RoomsOrSpaces.
AssemblyInstanceId |  The id of the assembly instance to which the element belongs.
(Inherited from Element)
BoundingBox | Retrieves a box that circumscribes all geometry of the element.
(Inherited from Element)
BuildingConstructionClass |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Construction class of building as defined by: loose, medium, tight, or none.
BuildingEnvelopeDeterminationMethod |  Indicates if an analysis should be performed to find the model elements that are part of the building envelope.
BuildingHVACSystem | Obsolete.
 The type of HVAC system used by the building for conceptual model energy calculations.
BuildingOperatingSchedule | Obsolete.
 The operating schedule of the building used for conceptual model energy calculations.
BuildingType |  The type of building.
BuildingTypeId |  The building type element.
Category | Retrieves a Category object that represents the category or sub category in which the element resides.
(Inherited from Element)
CoreOffset |  The default offset used to determine the outer perimeter to be divided into zones. Ignored if AnalysisType is not ConceptualMassesAndBuildingElements.
CreateAnalyticalModel | Obsolete.
 If this is true, data, features, and geometry related to the Energy Analytical Model will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
CreatedPhaseId |  Id of a Phase at which the Element was created.
(Inherited from Element)
DemolishedPhaseId |  Id of a Phase at which the Element was demolished.
(Inherited from Element)
DesignOption | Returns the design option to which the element belongs.
(Inherited from Element)
DividePerimeter |  If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
Document | Returns the Document in which the Element resides.
(Inherited from Element)
EnergyModel |  if this is on there should be an energy model dependent on the current AnalysisType if it is off the conceptual energy model should be turned off
ExportCategory |  Value is a category indicating which discipline model will be used for GreenBuildingXML export. This property only applies if AnalysisType is RoomsOrSpaces.
ExportComplexity |  Value determines Export Complexity when AnalysisType is RoomsOrSpaces.
ExportDefaults | Obsolete.
 Use for detailed model GreenBuildingXML export. When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML. When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.
Geometry | Retrieves the geometric representation of the element.
(Inherited from Element)
GroundPlane |  Id of level which represents ground level.
GroupId |  The id of the group to which an element belongs.
(Inherited from Element)
Id |  A unique identifier for an Element in an Autodesk Revit project.
(Inherited from Element)
IncludeThermalProperties |  Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
IsExportMullionsEnabled |  Indicates if mullions are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsExportShadingSurfacesEnabled |  Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsExportSimplifiedCurtainSystemsEnabled |  Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model. This property only applies if AnalysisType is RoomsOrSpaces.
IsGlazingShaded | Obsolete.
 If this is true, glazing/windows that are auto-created on exterior walls will automatically have a shading device created on their top edge.
IsModifiable |  Identifies if the element is modifiable.
(Inherited from Element)
IsTransient |  Indicates whether an element is transient or permanent.
(Inherited from Element)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Element)
LevelId |  The id of the level associated with the element.
(Inherited from Element)
Location | This property is used to find the physical location of an element within a project.
(Inherited from Element)
Name | A human readable name for the Element.
(Inherited from Element)
OutsideAirChangesRatePerHour | Obsolete.
 The number of times the volume of air interchanges in the room in one hour.
OutsideAirPerArea | Obsolete.
 The rate of flow of outside air available per unit area.
OutsideAirPerPerson | Obsolete.
 The rate of flow of outside air available per person.
OwnerViewId |  The id of the view that owns the element.
(Inherited from Element)
Parameter[BuiltInParameter] | Retrieves a parameter from the element given a parameter id.
(Inherited from Element)
Parameter[Definition] | Retrieves a parameter from the element based on its definition.
(Inherited from Element)
Parameter[Guid] | Retrieves a parameter from the element given a GUID for a shared parameter.
(Inherited from Element)
Parameters | Retrieves a set containing all of the parameters that are contained within the element.
(Inherited from Element)
ParametersMap | Retrieves a map containing all of the parameters that are contained within the element.
(Inherited from Element)
PercentageGlazing |  Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building exterior wall surfaces which are covered by windows or other glazing.
PercentageSkylights |  Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building roof surfaces for masses.
Pinned |  Identifies if the element has been pinned to prevent changes.
(Inherited from Element)
ProjectPhase |  The project phase of the EnergyData information.
ProjectReportType |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Report type: None, simple, standard, detailed, compact.
ReportsFolder |  The folder path where all systems analysis reports are stored. It may include special label and relative path.
ServiceType |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). The type of heating or cooling system.
ShadeDepth | Obsolete.
 Used for the conceptual energy model. Amount that auto-generated shading will extend from auto-generated windows.
SillHeight | Obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The height from the nearest lower level used for auto-glazing created on walls.
SkylightWidth | Obsolete.
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate width used for the skylights in massing instances when the Energy Analytical model is being created.
SliverSpaceTolerance |  This property only applies if AnalysisType is RoomsOrSpaces. This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
UniqueId |  A stable unique identifier for an element within the document.
(Inherited from Element)
UseAirChangesPerHour |  True if user is specifying air changes per hour, false otherwise.
UseCurrentViewOnly |  True if only elements visible in the currently active view are used for generation of Energy Model.
UseHeatingCredits |  Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). If true, Revit will use heating credits in the final load sum calculations. If false, Revit will ignore heating credits in the final load sum calculations.
UseOutsideAirPerArea | Obsolete.
 True is user is specifying outside air per area, false otherwise.
UseOutsideAirPerPerson | Obsolete.
 True if user is specifying outside air per person, false otherwise. Deprecated in Revit 2027 and may be removed in a later version of Revit.
VersionGuid |  Get the element version Guid.
(Inherited from Element)
ViewSpecific |  Identifies if the element is owned by a view.
(Inherited from Element)
WorksetId |  Get Id of the Workset which owns the element.
(Inherited from Element)
Top
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace